abrahamhadaf/CC3200-IoT-Fire-Protection-System/Final Project AWS2/main.c
            // Report the calculate temperature
            //
            float fCurrentTemp;
            TMP006DrvGetTemp(&fCurrentTemp);

            if(fCurrentTemp > 80){
                printWarning();
                Report("Danger! Too hot!");
                // THIS IS A POST TO AWS

                // Turn on Fan

                //Set Transistor GPIO pin to high
                GPIOPinWrite(GPIOA3_BASE, 0x10, 0x10);

                //Connect the CC3200 to the local access point
                lRetVal = connectToAccessPoint();
                //Set time so that encryption can be used
                lRetVal = set_time();
                if(lRetVal < 0) {
                    UART_PRINT("Unable to set time in the device");
                    LOOP_FOREVER();
                }
                //Connect to the website with TLS encryption
                lRetVal = tls_connect();
                if(lRetVal < 0) {
                    ERR_PRINT(lRetVal);
                }


                UART_PRINT("Sending...");
                http_post(lRetVal);


                sl_Stop(SL_STOP_TIMEOUT);
                LOOP_FOREVER();

            }
            else {
                printIntroduction();
            }


            Report("Temperature: %f F\n\n\r",fCurrentTemp);

            //
            // Delay loop
            //
            MAP_UtilsDelay(80000000/5);



}


}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************

static int http_post(int iTLSSockID){
    char acSendBuff[512];
    char acRecvbuff[1460];
    char cCLLength[200];
    char* pcBufHeaders;
    int lRetVal = 0;

    pcBufHeaders = acSendBuff;
    strcpy(pcBufHeaders, POSTHEADER);
    pcBufHeaders += strlen(POSTHEADER);
    strcpy(pcBufHeaders, HOSTHEADER);
    pcBufHeaders += strlen(HOSTHEADER);
    strcpy(pcBufHeaders, CHEADER);
    pcBufHeaders += strlen(CHEADER);
    strcpy(pcBufHeaders, "\r\n\r\n");

    int dataLength = strlen(DATA1);

    strcpy(pcBufHeaders, CTHEADER);
    pcBufHeaders += strlen(CTHEADER);
    strcpy(pcBufHeaders, CLHEADER1);

    pcBufHeaders += strlen(CLHEADER1);
    sprintf(cCLLength, "%d", dataLength);

    strcpy(pcBufHeaders, cCLLength);
    pcBufHeaders += strlen(cCLLength);
    strcpy(pcBufHeaders, CLHEADER2);
    pcBufHeaders += strlen(CLHEADER2);

    strcpy(pcBufHeaders, DATA1);
    pcBufHeaders += strlen(DATA1);

    int testDataLength = strlen(pcBufHeaders);

    UART_PRINT(acSendBuff);


    //
    // Send the packet to the server */
    //
    lRetVal = sl_Send(iTLSSockID, acSendBuff, strlen(acSendBuff), 0);
    if(lRetVal < 0) {
        UART_PRINT("POST failed. Error Number: %i\n\r",lRetVal);
        sl_Close(iTLSSockID);
        GPIO_IF_LedOn(MCU_RED_LED_GPIO);
        return lRetVal;
    }
    lRetVal = sl_Recv(iTLSSockID, &acRecvbuff[0], sizeof(acRecvbuff), 0);
    if(lRetVal < 0) {
        UART_PRINT("Received failed. Error Number: %i\n\r",lRetVal);
        //sl_Close(iSSLSockID);
        GPIO_IF_LedOn(MCU_RED_LED_GPIO);
           return lRetVal;
    }
    else {
        acRecvbuff[lRetVal+1] = '\0';
        UART_PRINT(acRecvbuff);
        UART_PRINT("\n\r\n\r");
    }

    return 0;
}
